{"module": "keras", "class_name": "Sequential", "config": {"name": "sequential_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 20], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer_2"}, "registered_name": null}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 20]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.5, "seed": null, "noise_shape": null}, "registered_name": null}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}}], "build_input_shape": [null, 20]}, "registered_name": null, "build_config": {"input_shape": [null, 20]}, "compile_config": {"optimizer": {"module": "keras.optimizers", "class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}, "registered_name": null}, "loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false}, "weights": [[[0.05081938952207565, -0.07184934616088867, 0.11928925663232803, -0.11523125320672989, -0.05198681354522705, -0.07712952792644501, -0.10428596287965775, 0.006765797734260559, -0.10720966756343842, 0.26825228333473206, 0.032236576080322266, 0.12955103814601898, 0.09220698475837708, 0.1782839149236679, 0.2453644573688507, -0.019250214099884033, 0.11341723799705505, 0.02429485321044922, -0.07474437355995178, 0.10076694935560226, -0.053360387682914734, -0.0904107466340065, -0.0893932357430458, 0.08282851427793503, -0.051612332463264465, 0.01308215968310833, 0.009712472558021545, 0.13621386885643005, -0.14750301837921143, -0.08757404237985611, 0.28840845823287964, -0.09182468056678772, -0.1170167475938797, -0.18019501864910126, -0.09373728930950165, -0.14091075956821442, 0.17059467732906342, -0.1091875433921814, 0.24756450951099396, -0.20114490389823914, -0.0673900693655014, 0.2638990879058838, -0.0034334957599639893, -0.15000417828559875, -0.08899009227752686, -0.10337977856397629, -0.1589759886264801, -0.13569128513336182, 0.27782419323921204, -0.1900632381439209, 0.07944001257419586, -0.10918662697076797, 0.2014695405960083, 0.19040733575820923, -0.1928415149450302, 0.07822032272815704, -0.11319392919540405, 0.0836501270532608, 0.022642523050308228, 0.07006610929965973, 0.1233619973063469, 0.007791420910507441, 0.18512694537639618, -0.19546838104724884, 0.3240841329097748, -0.1711486130952835, -0.003919452428817749, -0.1490907371044159, -0.01587696745991707, 0.0030697316396981478, -0.1378248631954193, 0.19985990226268768, 0.035301562398672104, -0.23149438202381134, 0.21199950575828552, 0.23599331080913544, 0.04880829155445099, 0.024421237409114838, -0.08119139075279236, -0.14789047837257385, -0.07639093697071075, 0.16772153973579407, 0.04525360092520714, 0.20415343344211578, 0.04155503213405609, -0.08341783285140991, 0.15399816632270813, -0.10906095802783966, 0.19174450635910034, 0.10133713483810425, 0.024085210636258125, 0.020564883947372437, 0.152603879570961, -0.012705777771770954, -0.05488605052232742, 0.0802169069647789, -0.1534760743379593, 0.02367880940437317, 0.011758903041481972, 0.2629353702068329, -0.10963398963212967, 0.04316927120089531, -0.04040626063942909, -0.09605304151773453, 0.19008728861808777, -0.18339839577674866, -0.12217693775892258, 0.18175768852233887, -0.1301104724407196, -0.0075110881589353085, -0.18371665477752686, 0.11034151911735535, 0.1478108912706375, 0.26726317405700684, 0.03990558534860611, 0.0140170156955719, 0.015445261262357235, 0.2806724011898041, 0.1613157093524933, 0.08665864169597626, -0.19180062413215637, -0.06426861882209778, -0.17246179282665253, -0.1872594654560089, -0.15773636102676392, -0.04780435562133789, -0.10106028616428375, 0.10364917665719986], [-0.01646169275045395, 0.23413527011871338, -0.09661608934402466, 0.16101716458797455, -0.020992323756217957, -0.24110877513885498, 0.15710443258285522, 0.017139971256256104, 0.04483833163976669, 0.28728970885276794, -0.06318384408950806, 0.2522285580635071, -0.17562049627304077, 0.1210632473230362, -0.1798057109117508, 0.16562385857105255, -0.19258493185043335, -0.0001497715711593628, -0.2564637064933777, 0.29312098026275635, 0.03866920620203018, 0.15038935840129852, -0.1343611180782318, -0.23385894298553467, -0.10625410825014114, 0.25820833444595337, -0.004904270172119141, -0.16676509380340576, 0.07311145961284637, 0.05650262162089348, 0.048024266958236694, -0.025799572467803955, 0.02965439110994339, 0.029586249962449074, -0.13582228124141693, -0.12643451988697052, 0.13029637932777405, -0.16236194968223572, 0.12021607160568237, 0.06738737970590591, 0.032666634768247604, 0.15086472034454346, 0.027011720463633537, 0.22635939717292786, 0.08600998669862747, -0.10906436294317245, 0.2206968069076538, 0.010031476616859436, 0.18604128062725067, 0.016175225377082825, 0.0017516666557639837, -0.0929330363869667, 0.12320122122764587, -0.11505262553691864, -0.13772405683994293, 0.2545725703239441, -0.12370803952217102, -0.12592639029026031, 0.16562965512275696, -0.20841573178768158, -0.001871382468380034, -0.08161134272813797, 0.19219918549060822, -0.126932755112648, -0.02647373639047146, -0.110865019261837, -0.19506226480007172, -0.07440792769193649, 0.18933869898319244, 0.2233583927154541, -0.02861744724214077, 0.10804592818021774, 0.018467221409082413, 0.0830722525715828, 0.3042052388191223, -0.17955584824085236, -0.0709923654794693, 0.2779281437397003, 0.188908651471138, -0.12862282991409302, -0.13641910254955292, 0.003160342574119568, -0.1760300099849701, 0.20621821284294128, -0.08393686264753342, -0.15181487798690796, -0.19400648772716522, -0.17347514629364014, -0.11248038709163666, -0.07355508208274841, -0.07869348675012589, -0.04730329290032387, 0.21638189256191254, 0.2567175030708313, -0.013722095638513565, -0.0002205371856689453, 0.041778285056352615, -0.08016310632228851, -0.1644572764635086, 0.1280423253774643, -0.10633066296577454, 0.2690381109714508, 0.19114521145820618, 0.03145141154527664, -0.03596314415335655, 0.00989513099193573, 0.0010170340538024902, 0.15533143281936646, 0.0878099575638771, 0.0033839119132608175, 0.24559320509433746, 0.18323299288749695, 0.21833060681819916, 0.18927446007728577, 0.10420721024274826, -0.13237911462783813, 0.07621830701828003, -0.05511827766895294, 0.17352057993412018, -0.029912499710917473, -0.165455624461174, -0.08623740822076797, -0.15303121507167816, 0.021891595795750618, 0.02603280358016491, 0.20634278655052185, -0.025245297700166702, 0.13283225893974304], [0.27136000990867615, -0.0537789911031723, 0.3003280758857727, -0.04969831183552742, -0.1342780888080597, -0.10002169758081436, 0.3157946765422821, 0.14327430725097656, 0.3086293637752533, 0.29533037543296814, -0.09967188537120819, 0.33061251044273376, -0.08992260694503784, 0.05922378599643707, -0.12535245716571808, -0.1129990741610527, 0.07385525107383728, -0.1858922839164734, -0.12671726942062378, -0.0016049848636612296, -0.12294711917638779, -0.15034592151641846, -0.11248715221881866, -0.16308706998825073, 0.046878229826688766, -0.05161481350660324, 0.0741846039891243, -0.07231561839580536, 0.05355294048786163, -0.09746524691581726, 0.11243904381990433, -0.12423229962587357, 0.2753874659538269, 0.1811843067407608, 0.32272887229919434, -0.07305644452571869, -0.06859777867794037, 0.29764631390571594, 0.021584736183285713, -0.13387876749038696, 0.19449783861637115, -0.17944878339767456, -0.017743399366736412, -0.050384052097797394, 0.3188355267047882, 0.1273185759782791, 0.018613342195749283, 0.1871194988489151, 0.025343194603919983, 0.19153587520122528, 0.2244231402873993, 0.27916601300239563, -0.0691889226436615, 0.26777204871177673, -0.048085879534482956, -0.15266792476177216, 0.017503583803772926, 0.28465986251831055, 0.014052988030016422, -0.18942880630493164, -0.18396355211734772, -0.06363992393016815, 0.030379947274923325, 0.05788235366344452, -0.13845756649971008, 0.23171573877334595, 0.0763123407959938, -0.1167505607008934, -0.01723824255168438, -0.13161928951740265, -0.12971580028533936, -0.06738302856683731, -0.1356416642665863, 0.19474714994430542, -0.19932499527931213, -0.17611457407474518, 0.02950301021337509, -0.0967857763171196, 0.3401298224925995, 0.05613398179411888, -0.17128941416740417, -0.04573644697666168, 0.28287333250045776, -0.0871967002749443, 0.049196891486644745, 0.2536334991455078, 0.055898237973451614, 0.03257085010409355, -0.12162615358829498, -0.10882606357336044, -0.01672929897904396, 0.22992604970932007, 0.04340033605694771, -0.09095507115125656, 0.2105410397052765, -0.07438750565052032, 0.32210904359817505, 0.2749730348587036, -0.07276498526334763, -0.17657798528671265, 0.03323822468519211, -0.18379369378089905, 0.09312330186367035, 0.25156792998313904, 0.3242461681365967, -0.18500712513923645, -0.08827966451644897, -0.0740458071231842, 0.4070172607898712, 0.2704104483127594, -0.16363057494163513, -0.1256639063358307, -0.1835772544145584, -0.10822545737028122, -0.16353730857372284, -0.0821671187877655, -0.007666478864848614, 0.014499516226351261, -0.11398777365684509, -0.11855242401361465, 0.13894426822662354, 0.06997774541378021, 0.18110038340091705, -0.13791075348854065, -0.10394316166639328, -0.10560134053230286, 0.38070061802864075, -0.18368104100227356], [0.11555831879377365, -0.06932049989700317, 0.10568118095397949, -0.1186685636639595, -0.17820638418197632, 0.2873086929321289, -0.03763505816459656, -0.16876214742660522, 0.30634820461273193, 0.16035981476306915, 0.027463005855679512, -0.028842449188232422, 0.08403775840997696, -0.055066660046577454, -0.24123944342136383, -0.23436295986175537, -0.04406328499317169, 0.28436386585235596, -0.019547462463378906, 0.03343271464109421, -0.009940198622643948, -0.015375169925391674, -0.10814852267503738, 0.10861165821552277, 0.010384351015090942, -0.1814901977777481, 0.08165894448757172, 0.1138436570763588, -0.01955011487007141, 0.26626962423324585, 0.12639036774635315, 0.012430846691131592, 0.2853897511959076, 0.1434217393398285, 0.11437631398439407, -0.14163607358932495, -0.16845932602882385, 0.26786530017852783, -0.04097001254558563, 0.20401877164840698, -0.1297624558210373, -0.034875351935625076, -0.10896304249763489, -0.11403127759695053, 0.0037860646843910217, 0.11722466349601746, 0.030903339385986328, 0.19702987372875214, 0.12131248414516449, 0.27202776074409485, -0.17778877913951874, 0.248324453830719, 0.031793173402547836, 0.19460640847682953, 0.05601700022816658, -0.17248722910881042, -0.1311456263065338, -0.006074294447898865, -0.11393221467733383, 0.2569316327571869, -0.2063944935798645, -0.09007749706506729, -0.0305307786911726, -0.06970424950122833, 0.07963375002145767, 0.31768980622291565, -0.19099193811416626, 0.03582066297531128, -0.04835242033004761, 0.022926971316337585, 0.1655312031507492, -0.02481071650981903, 0.10827463120222092, -0.197024405002594, 0.25958794355392456, -0.031353726983070374, 0.12229067832231522, -0.1042456179857254, 0.3405551612377167, 0.25474661588668823, -0.1350448578596115, -0.18113908171653748, 0.09160101413726807, -0.0767950713634491, 0.1138000413775444, 0.15916723012924194, 0.045844532549381256, 0.34408628940582275, 0.0262611024081707, -0.20014415681362152, -0.06995000690221786, -0.08742062002420425, -0.12858577072620392, 0.06905901432037354, 0.09289863705635071, -0.1733805537223816, 0.2786993682384491, 0.07599055767059326, -0.1846153736114502, -0.00317089119926095, -0.10676387697458267, -0.1578271985054016, -0.02925584837794304, 0.2150537520647049, 0.13985013961791992, 0.16431471705436707, 0.018947135657072067, -0.14618542790412903, 0.21039699018001556, -0.04787391424179077, -0.026635149493813515, -0.09137099981307983, -0.18602514266967773, -0.08243677020072937, -0.09226731210947037, -0.04623456671833992, 0.013711723499000072, -0.011219009757041931, -0.11216408014297485, -0.18057192862033844, -0.13462471961975098, -0.14753201603889465, 0.25489822030067444, 0.22679772973060608, 0.13250912725925446, -0.11324222385883331, -0.147666335105896, -0.1202661395072937], [0.04872667416930199, 0.29884740710258484, -0.18778713047504425, 0.281545490026474, 0.11847379803657532, -0.11457537859678268, -0.1407143771648407, -0.20005188882350922, -0.06129308044910431, -0.17252059280872345, -0.03397132456302643, 0.12934282422065735, 0.07188530266284943, 0.0570988655090332, -0.035725031048059464, 0.08337874710559845, 0.11389416456222534, -0.059649646282196045, -0.0639612153172493, 0.20036110281944275, 0.02096507139503956, 0.1884809136390686, -0.1508236527442932, -0.06225576996803284, 0.21069219708442688, -0.10798507183790207, -0.0018119364976882935, 0.2923988997936249, -0.15202277898788452, 0.0619257390499115, 0.276840478181839, 0.06867092847824097, 0.08526123315095901, -0.14281031489372253, -0.08892537653446198, 0.049402110278606415, 0.1786295622587204, -0.24451132118701935, 0.19497083127498627, 0.29406240582466125, 0.016397587954998016, 0.2697521448135376, 0.036911092698574066, -0.09931501746177673, -0.22832217812538147, 0.057971104979515076, -0.1479051560163498, 0.09478704631328583, 0.2139415591955185, -0.009918227791786194, -0.044111624360084534, -0.01941586099565029, 0.20979078114032745, 0.049174148589372635, -0.10483696311712265, 0.10409274697303772, 0.16205720603466034, 0.07264236360788345, 0.27508169412612915, -0.1378680169582367, 0.040260594338178635, -0.043585970997810364, 0.16912518441677094, -0.0941019281744957, 0.35131582617759705, -0.17742988467216492, -0.12335193902254105, 0.06891083717346191, -0.15909263491630554, 0.2576662600040436, 0.007253039628267288, 0.25056135654449463, -0.16285836696624756, -0.1291062831878662, -0.03695829212665558, 0.19412924349308014, 0.1059405580163002, -0.03518739715218544, 0.08918461203575134, 0.07357104122638702, 0.00891798548400402, 0.08133062720298767, -0.17914919555187225, 0.22452914714813232, -0.021784821525216103, 0.14664264023303986, 0.14790654182434082, 0.05820691958069801, 0.07799145579338074, -0.2206171602010727, -0.06258134543895721, 0.2855956256389618, 0.26355111598968506, 0.2653011083602905, -0.0029824944213032722, -0.019018664956092834, -0.10984435677528381, 0.09515521675348282, -0.13258115947246552, -0.16167539358139038, -0.027324721217155457, 0.2636573016643524, 0.022228628396987915, -0.0900803878903389, 0.2827643156051636, -0.2128450870513916, -0.05030372738838196, 0.09017494320869446, 0.020653579384088516, -0.15318208932876587, 0.09479129314422607, 0.25755199790000916, -0.12830758094787598, 0.27878400683403015, -0.10320878028869629, -0.14535841345787048, -0.16897279024124146, -0.01060032844543457, 0.22488905489444733, -0.04749394953250885, 0.2338152825832367, -0.01079919096082449, -0.20583058893680573, -0.1455235481262207, 0.09588208794593811, 0.285525918006897, -0.11422635614871979, 0.13420090079307556], [-0.012394255958497524, 0.22276905179023743, -0.07147692143917084, 0.2723977267742157, -0.06777999550104141, 0.0385613739490509, 0.08543194830417633, 0.19985994696617126, 0.016415342688560486, -0.17261971533298492, -0.007305949926376343, 0.02785668522119522, 0.16064517199993134, -0.07682369649410248, 0.32255861163139343, 0.16900686919689178, -0.1351993978023529, -0.07890619337558746, 0.09814923256635666, 0.15237128734588623, -0.10596027970314026, 0.28848081827163696, -0.07158267498016357, -0.11821984499692917, 0.18876200914382935, -0.026834115386009216, -0.056329384446144104, 0.0038111184258013964, 0.1207444965839386, -0.18643738329410553, 0.06575112044811249, 0.08878976851701736, -0.2608660161495209, -0.1913425624370575, 0.008356541395187378, -0.010444915853440762, 0.1355283111333847, 0.1227034404873848, 0.17524313926696777, 0.21819832921028137, -0.11548773944377899, 0.1049269586801529, 0.216305211186409, -0.07837776094675064, 0.06344246119260788, -0.15024949610233307, 0.061945706605911255, 0.09741798043251038, 0.26320335268974304, -0.19786790013313293, -0.14404869079589844, 0.059554409235715866, 0.166156604886055, 0.16736628115177155, -0.16812670230865479, 0.09138951450586319, 0.25909101963043213, 0.11188621073961258, 0.24016374349594116, -0.08472394943237305, 0.21113868057727814, -0.027609825134277344, 0.045152902603149414, -0.022969350218772888, 0.10119280219078064, 0.004904951900243759, -0.015732616186141968, -0.1643744558095932, 0.09194090962409973, 0.20323027670383453, -0.10352044552564621, 0.14321297407150269, -0.16612164676189423, -0.14188189804553986, -0.1393454670906067, 0.08458203077316284, 0.28748250007629395, 0.23291140794754028, 0.19313274323940277, 0.03614890202879906, -0.07747605443000793, -0.14905694127082825, 0.01362261176109314, -0.011078684590756893, -0.06463161110877991, -0.15702424943447113, 0.05546117201447487, -0.2767554521560669, 0.19838474690914154, 0.1180485263466835, -0.010734409093856812, 0.24803051352500916, 0.10636520385742188, 0.2885768711566925, -0.09052934497594833, 0.044332630932331085, 0.007403453812003136, -0.11635387688875198, -0.06215798854827881, -0.1990956813097, -0.017125234007835388, 0.05112997069954872, -0.07759950309991837, -0.009295444004237652, 0.2837059795856476, 0.1518101990222931, -0.11652623116970062, -0.1861373484134674, -0.19607792794704437, 0.0478493869304657, -0.12494891881942749, 0.1955997496843338, -0.17274031043052673, 0.19040647149085999, -0.08460019528865814, 0.08472323417663574, -0.1912238895893097, -0.1864081472158432, -0.05724542215466499, -0.07281666994094849, -0.07034251093864441, -0.1804697960615158, 0.015312405303120613, 0.09404624998569489, -0.17941996455192566, 0.1340027153491974, -0.11527809500694275, 0.05780496075749397], [-0.09298726171255112, 0.015778955072164536, 0.3298548758029938, -0.09581997245550156, -0.013612732291221619, 0.2068251073360443, -0.1929863840341568, -0.14391173422336578, -0.06386148929595947, -0.09210751950740814, -0.09994051605463028, 0.25639259815216064, -0.10422936081886292, 0.05026444047689438, -0.1287432163953781, -0.1133672222495079, -0.05893541872501373, 0.3659937381744385, -0.07449740916490555, -0.04393206909298897, -0.1821143627166748, -0.1889098733663559, -0.04817816615104675, -0.09101920574903488, -0.0802767351269722, 0.015080656856298447, 0.0003313118650112301, -0.022707141935825348, -0.0060113477520644665, 0.28686124086380005, 0.23257938027381897, 0.3021380603313446, 0.18023501336574554, 0.1911703646183014, -0.03621949255466461, 0.031449832022190094, -0.06965499371290207, -0.1604660451412201, -0.15917827188968658, -0.17795492708683014, 0.10923828929662704, -0.1431959569454193, -0.17066924273967743, 0.13620047271251678, 0.25368794798851013, 0.3150239586830139, -0.10430636256933212, -0.17041543126106262, -0.025175346061587334, 0.047167401760816574, 0.31702134013175964, 0.3506385087966919, -0.17831505835056305, 0.007159223780035973, -0.04365818575024605, -0.15324367582798004, 0.03478706255555153, -0.13837575912475586, -0.1514912098646164, -0.08344846218824387, -0.18910779058933258, -0.06306341290473938, -0.12110478430986404, -0.03612297773361206, 0.28554487228393555, 0.3302076458930969, -0.039040833711624146, 0.0068381791934370995, -0.1428796350955963, 0.3808263838291168, -0.11963372677564621, -0.16006635129451752, 0.23804700374603271, 0.20829196274280548, -0.1654883623123169, 0.043353330343961716, -0.0008005654672160745, -0.1398039609193802, 0.25509774684906006, 0.1783725768327713, -0.07041116803884506, -0.018962036818265915, -0.19522759318351746, -0.1822315752506256, 0.08103369176387787, 0.31136244535446167, 0.13198678195476532, 0.24726998805999756, -0.12076783925294876, 0.11779782921075821, -0.19258247315883636, 0.09335973113775253, -0.009984196163713932, -0.12632238864898682, 0.29323670268058777, -0.1886516511440277, 0.28724098205566406, 0.3530290126800537, -0.07791879028081894, -0.17006157338619232, 0.06149843707680702, -0.1860620677471161, -0.14127905666828156, 0.2700374126434326, 0.07505021244287491, -0.0972626656293869, -0.06209135428071022, 0.004461638163775206, 0.1662353277206421, 0.27696120738983154, 0.031964462250471115, -0.15210558474063873, -0.179182767868042, -0.130670964717865, -0.13922789692878723, -0.036296866834163666, 0.04989100992679596, -0.011781588196754456, -0.11435447633266449, -0.1602843552827835, -0.04421244561672211, 0.41409832239151, 0.23037007451057434, -0.06732504069805145, 0.376532644033432, -0.09778168052434921, 0.023368097841739655, -0.00896892324090004], [-0.027333395555615425, -0.10031082481145859, -0.07039187848567963, 0.24057668447494507, -0.18220119178295135, -0.07674981653690338, -0.07326876372098923, 0.009200402535498142, -0.04837724566459656, -0.13809436559677124, 0.11400827020406723, 0.028209008276462555, -0.09816794097423553, -0.12013201415538788, 0.215415820479393, 0.2819086015224457, -0.18256674706935883, -0.10816317051649094, -0.07650788873434067, 0.32010942697525024, -0.12101992219686508, -0.06947141885757446, -0.0809759721159935, -0.06062575429677963, -0.13102498650550842, 0.2320055514574051, -0.12482535094022751, -0.11854325234889984, -0.012923240661621094, -0.19505904614925385, -0.10965362191200256, 0.15789653360843658, 0.09910902380943298, -0.11873800307512283, -0.024910813197493553, -0.09836725890636444, 0.2897278666496277, -0.1225396916270256, -0.06833428144454956, 0.2787177562713623, -0.056770097464323044, 0.3225212097167969, 0.24487268924713135, 0.1611267328262329, -0.17908601462841034, -0.08361075073480606, 0.33566805720329285, -0.09267877787351608, 0.29569926857948303, -0.13192221522331238, -0.1636032611131668, -0.012642769142985344, -0.1914450079202652, 0.20575207471847534, -0.009190843440592289, -0.05348178744316101, 0.15299364924430847, -0.14942504465579987, 0.33076032996177673, -0.12119671702384949, 0.06263909488916397, -0.06268046051263809, -0.05865229666233063, -0.18343952298164368, 0.37139979004859924, -0.04165640100836754, -0.09132657945156097, -0.07731308043003082, 0.309631884098053, 0.08072081208229065, -0.09507596492767334, 0.19670243561267853, -0.20039008557796478, -0.098310187458992, 0.22323063015937805, -0.018776550889015198, 0.314130574464798, 0.24556618928909302, -0.12173686921596527, -0.11081104725599289, -0.07001854479312897, 0.330878347158432, -0.10746124386787415, -0.16515664756298065, -0.17166700959205627, -0.008579608984291553, 0.09686095267534256, -0.22040235996246338, 0.11502913385629654, -0.10339714586734772, 0.2961093783378601, 0.16528071463108063, -0.03567185997962952, 0.2685762643814087, -0.10265947133302689, -0.09078148752450943, -0.11052682995796204, 0.042006466537714005, 0.07652860879898071, 0.17285749316215515, -0.059794798493385315, 0.08151297271251678, -0.0011619627475738525, -0.09907878935337067, 0.032216690480709076, -0.055358968675136566, -0.061522241681814194, -0.06220570206642151, -0.17594173550605774, 0.21294431388378143, -0.1279785931110382, 0.25239527225494385, 0.27997979521751404, 0.3599557876586914, -0.059887126088142395, -0.035901252180337906, -0.13921810686588287, 0.32596948742866516, 0.04310397431254387, -0.12043976038694382, 0.20999281108379364, -0.1773349493741989, -0.1800881028175354, -0.19952186942100525, -0.08949247002601624, 0.3381761312484741, -0.23028166592121124, 0.11412929743528366], [-0.1557077169418335, 0.2217126041650772, -0.14706727862358093, 0.023481598123908043, 0.0003453940153121948, 0.15636245906352997, -0.05432208999991417, 0.004471184685826302, -0.13151267170906067, 0.07696940749883652, -0.03779352456331253, -0.05901986360549927, 0.07328914850950241, -0.1935396045446396, -0.23930680751800537, 0.041803620755672455, 0.11042949557304382, 0.027963582426309586, -0.14021210372447968, 0.015451478771865368, -0.11563276499509811, 0.0017514526844024658, 0.047213271260261536, 0.2219419926404953, -0.050692614167928696, -0.17250868678092957, -0.17907358705997467, -0.1028580591082573, 0.3703688979148865, -0.10377394407987595, 0.15606212615966797, 0.040693242102861404, -0.09422045201063156, 0.24525707960128784, -0.08982561528682709, 0.10921748727560043, 0.10587164759635925, -0.06667649745941162, 0.13874183595180511, 0.020733997225761414, -0.012840330600738525, -0.048933204263448715, -0.17002534866333008, -0.06635124981403351, -0.15009629726409912, -0.16630616784095764, -0.13199689984321594, 0.10673384368419647, -0.269722580909729, -0.2131744772195816, 0.11659394949674606, -0.023557603359222412, -0.0948183462023735, 0.08998379856348038, 0.13714177906513214, 0.04120123013854027, -0.023453667759895325, 0.047646310180425644, -0.14625878632068634, -0.14332127571105957, 0.3950117230415344, -0.1775568276643753, 0.004673871677368879, 0.24556782841682434, -0.10349229723215103, -0.13305342197418213, -0.188106507062912, 0.28416240215301514, 0.07091781497001648, -0.028346724808216095, -0.18821130692958832, 0.05577809363603592, -0.15239910781383514, -0.21308296918869019, 0.11151791363954544, -0.03593914210796356, -0.1647382378578186, -0.19097748398780823, -0.004254080820828676, 0.3285773694515228, 0.31765300035476685, 0.014540252275764942, -0.17269878089427948, -0.02607344649732113, -0.18038488924503326, -0.019585445523262024, -0.15392127633094788, -0.15002717077732086, -0.15961122512817383, 0.2238595187664032, 0.05425028130412102, -0.03929910063743591, 0.08938366919755936, 0.3187582194805145, 0.057894736528396606, -0.022025829181075096, 0.24266177415847778, -0.09437897056341171, 0.20917651057243347, 0.03497572988271713, -0.1118459552526474, 0.27039626240730286, -0.18201354146003723, 0.1621527224779129, -0.09777996689081192, -0.16131852567195892, 0.31053733825683594, -0.13553902506828308, 0.00017257645959034562, -0.02393724024295807, -0.07910104840993881, 0.2210494577884674, 0.23727206885814667, 0.04221503809094429, -0.15290355682373047, 0.2680612802505493, 0.024525661021471024, 0.08835989236831665, 0.2547404170036316, 0.26422813534736633, 0.03559562563896179, -0.04516909271478653, 0.21492306888103485, -0.10613030940294266, -0.12966735661029816, -0.03616372123360634, 0.07837943732738495, 0.29878708720207214], [-0.16330918669700623, 0.19245490431785583, -0.05964810028672218, -0.08535761386156082, 0.017062952741980553, -0.10685916244983673, -0.16148437559604645, 0.019468866288661957, -0.11541400849819183, -0.01992262899875641, -0.14057688415050507, -0.007058309856802225, 0.3073084354400635, -0.03960272669792175, -0.16837571561336517, 0.3644537329673767, -0.010644346475601196, -0.14280171692371368, -0.17427857220172882, 0.2820623517036438, -0.001928019686602056, 0.08297162503004074, 0.0376945324242115, -0.019914723932743073, -0.009598523378372192, 0.31977221369743347, -0.09281362593173981, -0.19252347946166992, 0.31226077675819397, -0.08837095648050308, 0.3186926245689392, -0.0957631841301918, -0.23028291761875153, -0.08882927149534225, -0.024479757994413376, -0.0666208267211914, 0.15680183470249176, 0.043879225850105286, 0.15405967831611633, 0.29317647218704224, -0.10367875546216965, 0.3575075566768646, 0.2652986943721771, 0.3158508539199829, -0.1605200320482254, -0.09197602421045303, -0.055508166551589966, 0.07796289026737213, 0.29390978813171387, -0.13518419861793518, -0.1882336288690567, -0.14944970607757568, 0.2614242136478424, 0.05956104025244713, -0.17739024758338928, 0.16265511512756348, -0.11044430732727051, 0.15807227790355682, -0.016655266284942627, -8.276760490844026e-05, 0.07289427518844604, -0.16706037521362305, -0.17660105228424072, -0.1864318549633026, 0.26665621995925903, -0.17110423743724823, 0.050389595329761505, -0.07439062744379044, 0.30412086844444275, 0.32581010460853577, -0.16829539835453033, 0.06753159314393997, -0.09357786178588867, -0.1439284384250641, -0.17116713523864746, 0.3201949894428253, 0.24451342225074768, 0.1579103022813797, 0.13455674052238464, -0.1599465012550354, -0.07119967043399811, 0.2744104564189911, 0.029820067808032036, 0.31901121139526367, -0.07495195418596268, -0.009807136841118336, 0.167221337556839, -0.18099762499332428, 0.22326432168483734, -0.10530009865760803, 0.3174282908439636, -0.09928443282842636, 0.1349874585866928, -0.1505914181470871, -0.14970409870147705, -0.007543197833001614, -0.10854338854551315, -0.025326771661639214, 0.014710905961692333, 0.3532019853591919, -0.20049674808979034, 0.3525504767894745, 0.15706151723861694, -0.09785681217908859, -0.18527455627918243, -0.05918513610959053, -0.18898384273052216, -0.05349695682525635, 0.02973204292356968, 0.28598451614379883, -0.1148344948887825, -0.16203619539737701, 0.32256975769996643, 0.300231397151947, -0.15569356083869934, -0.13400152325630188, 0.21568404138088226, -0.08452276140451431, 0.024752622470259666, -0.12042174488306046, -0.13175652921199799, -0.17839866876602173, -0.18564794957637787, -0.09879343956708908, -0.16274599730968475, -0.19655179977416992, -0.22674816846847534, 0.14625540375709534], [-0.040735386312007904, 0.2577758729457855, 0.033780112862586975, 0.26926612854003906, 0.044847115874290466, 0.057251427322626114, -0.0984933152794838, 0.1048869788646698, 0.02770780771970749, 0.25965631008148193, 0.009323924779891968, -0.08245793730020523, 0.011054649949073792, 0.30780741572380066, -0.06362751126289368, -0.13801570236682892, -0.1595059037208557, -0.1895034909248352, -0.03354126214981079, 0.22353751957416534, -0.3153550624847412, 0.12755446135997772, -0.03399980068206787, -0.02743792161345482, -0.1671820729970932, 0.07078439742326736, -0.0011078119277954102, 0.16901984810829163, 0.18675056099891663, -0.26557457447052, 0.008382320404052734, -0.12477508932352066, 0.12676028907299042, -0.22227595746517181, 0.055684078484773636, -0.08614416420459747, 0.202246755361557, -0.13218511641025543, -0.07531832158565521, 0.21736273169517517, -0.20899981260299683, 0.1902351975440979, 0.18670491874217987, 0.1164393350481987, -0.18338346481323242, -0.27296486496925354, -0.009705845266580582, -0.2002718448638916, -0.019643889740109444, -0.18983155488967896, -0.17747509479522705, -0.1763380765914917, 0.3099987506866455, 0.02660854160785675, 0.11405041813850403, 0.10935581475496292, -0.07337550818920135, -0.15754573047161102, -0.151581272482872, -0.017877694219350815, 0.0164807066321373, -0.13133208453655243, -0.05129262059926987, -0.18884459137916565, 0.3086971044540405, -0.14514386653900146, -0.15672354400157928, 0.09329944849014282, 0.21590618789196014, 0.2574935853481293, -0.21759697794914246, 0.0428377129137516, 0.1251012533903122, 0.043657444417476654, 0.29502731561660767, -0.1993461698293686, -0.18109147250652313, -0.06305799633264542, 0.20137208700180054, -0.14395858347415924, -0.19445936381816864, -0.008803606033325195, 0.16631492972373962, 0.30131855607032776, -0.17228581011295319, 0.09242185950279236, -0.167912557721138, -0.08174290508031845, -0.12931904196739197, 0.07182961702346802, -0.1502823531627655, 0.06599365919828415, -0.0747736245393753, 0.0032690921798348427, 0.10675593465566635, 0.12304744124412537, 0.0030897788237780333, 0.12029051780700684, -0.04897749051451683, 0.23838041722774506, 0.24764135479927063, 0.12395233660936356, -0.07390356063842773, 0.036629363894462585, 0.1701895147562027, -0.07263456284999847, -0.1738373190164566, 0.22328317165374756, -0.028903579339385033, 0.274692177772522, 0.2674771845340729, 0.11124661564826965, 0.12918099761009216, 0.14878495037555695, 0.17437279224395752, -0.13130730390548706, 0.19732137024402618, 0.15356621146202087, -0.09964023530483246, -0.13910949230194092, -0.0899714007973671, -0.2534281313419342, -0.24373510479927063, -0.2535841464996338, -0.1159508153796196, 0.31583794951438904, -0.18111196160316467, -0.1913311779499054], [0.14633332192897797, -0.05430305004119873, -0.0964060053229332, -0.04110422730445862, 0.05653304606676102, 0.0946301743388176, -0.1797403246164322, 0.005910158157348633, -0.0800437182188034, 0.2726021707057953, -0.08487919718027115, 0.20817434787750244, -0.16231678426265717, -0.09420544654130936, 0.19343577325344086, -0.12461139261722565, -0.11477434635162354, 0.0629793107509613, -0.1252259910106659, -0.034571047872304916, 0.09654181450605392, -0.15259748697280884, -0.01924474537372589, -0.10660217702388763, 0.07383981347084045, 0.09407918900251389, 0.17132964730262756, 0.2517722249031067, 0.0741284191608429, -0.0690353512763977, 0.2110293209552765, -0.18417514860630035, -0.11498028039932251, -0.014668571762740612, -0.00517943175509572, 0.010313928127288818, 0.00018223041843157262, -0.0047866106033325195, -0.05522826686501503, -0.042527034878730774, -0.16201689839363098, 0.25834232568740845, -0.022034496068954468, 0.026565298438072205, 0.08690802752971649, -0.01470436155796051, -0.11522803455591202, -0.1347183883190155, 0.19316305220127106, 0.09541386365890503, -0.05782564356923103, -0.16158604621887207, 0.043994177132844925, 0.02200242504477501, 0.04572339355945587, 0.17949101328849792, -0.10428091883659363, 0.05481811985373497, -0.16862903535366058, -0.18446646630764008, 0.02559201419353485, -0.044921353459358215, -0.10033828765153885, -0.03746713697910309, 0.02106173150241375, -0.10211417824029922, -0.11784789711236954, 0.007778167724609375, 0.14702671766281128, 0.005877399351447821, 0.149616539478302, 0.03274353966116905, 0.08984719961881638, 0.002224008785560727, 0.22236695885658264, 0.08375324308872223, 0.04700566828250885, 0.207394540309906, 0.16714736819267273, -0.1813293844461441, -0.13307878375053406, 0.20568276941776276, -0.18896567821502686, 0.22653906047344208, 0.06340081989765167, 0.005366027355194092, 0.22529548406600952, -0.12742272019386292, 0.15612265467643738, -0.13644957542419434, 0.23568151891231537, 0.006884858012199402, 0.22321206331253052, 0.25872135162353516, 0.044904544949531555, -0.19581635296344757, -0.023849084973335266, -0.14900600910186768, -0.026468666270375252, 0.13257049024105072, -0.18761052191257477, 0.25175103545188904, 0.17893321812152863, -0.09813395142555237, -0.09194257110357285, -0.038803309202194214, 0.0723658874630928, 0.07407160848379135, 0.103663370013237, 0.24356579780578613, 0.10153883695602417, -0.15606583654880524, 0.09304530918598175, 0.15057945251464844, 0.2705482244491577, 0.09074754267930984, 0.2688940465450287, 0.05721955746412277, 0.20724685490131378, -0.09596352279186249, 0.0873883068561554, -0.18300719559192657, 0.0997028648853302, 0.10457885265350342, -0.1982104629278183, -0.050812721252441406, 0.05377789959311485, 0.14469459652900696], [0.12169811874628067, -0.22208304703235626, 0.313746839761734, -0.1061139851808548, -0.054021984338760376, -0.05886361375451088, 0.27169671654701233, -0.06445088982582092, 0.2931469976902008, 0.2129833996295929, -0.06859937310218811, 0.2599928677082062, 0.030373672023415565, 0.08132070302963257, -0.01575787365436554, -0.17872464656829834, -0.08096392452716827, 0.10472224652767181, -0.14213836193084717, -0.0801144391298294, -0.12509706616401672, 0.10442093014717102, -0.07805099338293076, 0.160644993185997, -0.045973390340805054, -0.18007726967334747, 0.03524024784564972, 0.055049486458301544, -0.1474110633134842, 0.1669384092092514, 0.05954235792160034, 0.24491310119628906, 0.06376802921295166, -0.19843517243862152, -0.18544569611549377, 0.10881330072879791, -0.05057172849774361, 0.12451817840337753, -0.19040824472904205, 0.1246807649731636, -0.022527674213051796, -0.012770387344062328, -0.0345955453813076, -0.03236469253897667, 0.21619035303592682, -0.017337340861558914, -0.11557155847549438, -0.04529605805873871, -0.12458451092243195, 0.20217375457286835, -0.1848507821559906, 0.22612373530864716, -0.1512073576450348, -0.17218205332756042, 0.04579823091626167, -0.21537384390830994, -0.003186747431755066, -0.0015275961486622691, 0.17894506454467773, 0.13731539249420166, -0.2873668074607849, 0.06109798699617386, 0.06718503683805466, 0.06742493063211441, -0.09995266050100327, -0.030492275953292847, -0.02281026542186737, -0.04052115976810455, 0.14854569733142853, 0.21748016774654388, 0.27991992235183716, -0.19683942198753357, 0.13770806789398193, -0.13860389590263367, 0.06996934115886688, 0.08851763606071472, -0.052026718854904175, -0.11140497773885727, 0.30183687806129456, -0.13882888853549957, 0.027966881170868874, 0.09723338484764099, -0.1718103587627411, 0.040550827980041504, 0.09730269759893417, -0.158463716506958, -0.04859808087348938, 0.20524324476718903, -0.13295266032218933, -0.20779338479042053, 0.04675665870308876, 0.22743965685367584, 0.0938396006822586, -0.02520565502345562, 0.07628097385168076, 0.1318669319152832, 0.29438772797584534, 0.12589043378829956, -0.12377308309078217, 0.008490138687193394, -0.034556880593299866, -0.15647733211517334, 0.10759124159812927, 0.1388687789440155, 0.22308288514614105, -0.19950871169567108, 0.017341019585728645, -0.09353437274694443, 0.28230151534080505, 0.159709632396698, -0.13328365981578827, -0.01483024749904871, -0.14640890061855316, -0.055146023631095886, 0.051119767129421234, -0.1196301281452179, -0.0065256934612989426, 0.072487972676754, -0.08500932157039642, -0.29813671112060547, -0.012747163884341717, 0.37446272373199463, -0.05608298256993294, 0.29305970668792725, 0.15040278434753418, -0.25996333360671997, 0.1541663408279419, 0.04817500337958336], [0.24971428513526917, -0.025404013693332672, 0.273832768201828, -0.16723819077014923, -0.13319936394691467, 0.062184784561395645, -0.023705730214715004, 0.10725793242454529, 0.015327343717217445, 0.17893171310424805, -0.17782358825206757, 0.24128732085227966, 0.01170697808265686, 0.04151902720332146, -0.046424075961112976, 0.042874351143836975, -0.06678882241249084, 0.2545492947101593, -0.2119717001914978, -0.13826721906661987, -0.15675236284732819, -0.10851052403450012, -0.06669636070728302, 0.07389527559280396, 0.1220790222287178, -0.015888631343841553, 0.043941497802734375, 0.06042926013469696, -0.12264706194400787, 0.006132072303444147, -0.14281712472438812, 0.1340961456298828, -0.16296038031578064, -0.16480934619903564, 0.04813957214355469, 0.11320505291223526, -0.05660391226410866, 0.31152334809303284, 0.028254300355911255, -0.10523196309804916, 0.26582518219947815, -0.0696241557598114, 0.10918653011322021, 0.14695729315280914, 0.3005998134613037, -0.03926068916916847, -0.17957071959972382, 0.1291678249835968, -0.007573187351226807, 0.06902298331260681, -0.175939679145813, 0.22117121517658234, -0.04416726529598236, 0.07680559158325195, 0.01984206587076187, 0.15341489017009735, -0.16150334477424622, 0.22255262732505798, -0.12565544247627258, 0.2231520712375641, -0.24678939580917358, -0.20542943477630615, 0.0023573918733745813, -0.0007515697507187724, -0.16354215145111084, -0.07367712259292603, -0.03635291010141373, -0.06283710896968842, -0.1595306694507599, 0.1607702374458313, 0.29703953862190247, -0.1405666172504425, -0.10697923600673676, 0.10141071677207947, 0.1524709165096283, 0.007982343435287476, 0.019613713026046753, -0.20077469944953918, 0.08758220821619034, 0.08257494866847992, -0.10442419350147247, -0.030426807701587677, 0.09098628163337708, -0.08566518127918243, -0.2517808973789215, -0.11254523694515228, 0.16381146013736725, 0.27524128556251526, -0.08101888746023178, -0.13403256237506866, -0.1973605453968048, -0.09408006817102432, 0.09286899119615555, -0.12341870367527008, 0.18103773891925812, -0.1435767114162445, 0.20867836475372314, -0.126935213804245, -0.16439829766750336, -0.2801744043827057, 0.0402304045855999, -0.18639077246189117, -0.09345516562461853, 0.06913778930902481, 0.09155470132827759, 0.0020486116409301758, 0.07093297690153122, 0.011441618204116821, 0.2470046579837799, 0.2014780044555664, -0.04785721004009247, 0.0975579023361206, -0.13321766257286072, -0.16078120470046997, 0.039997398853302, 0.09289667010307312, -0.07121702283620834, 0.14375022053718567, -0.1329517364501953, 0.01349564641714096, 0.246614009141922, 0.3583090901374817, 0.05641568824648857, 0.2698131203651428, 0.3227549195289612, 0.09980829060077667, 0.35721489787101746, 0.13206824660301208], [0.18280886113643646, -0.02197122573852539, 0.29477542638778687, 0.06521087884902954, -0.03146903216838837, -0.051516108214855194, -0.12053141742944717, -0.17232473194599152, 0.051837336272001266, 0.31195250153541565, 0.24041476845741272, -0.15761053562164307, -0.15618151426315308, -0.14132767915725708, 0.113094761967659, 0.1183302104473114, -0.011306241154670715, 0.08449598401784897, -0.13678796589374542, -0.20217637717723846, -0.1352861225605011, 0.004909364506602287, -0.09655012935400009, 0.04313645511865616, -0.08775919675827026, 0.11908789724111557, -0.06495043635368347, -0.12310624122619629, -0.1886831372976303, 0.22909235954284668, 0.13717998564243317, -0.05948455631732941, 0.13539621233940125, 0.26321789622306824, 0.16212932765483856, -0.1865379512310028, 0.09904247522354126, 0.24852421879768372, 0.08426995575428009, 0.008723661303520203, -0.15648674964904785, -0.11306670308113098, 0.08498193323612213, -0.17881464958190918, 0.11103259027004242, 0.06847134977579117, -0.11070108413696289, -0.08055362850427628, 0.2844916582107544, 0.06336173415184021, -0.11622298508882523, 0.0684141144156456, -0.03203628212213516, 0.1540510505437851, -0.03479655086994171, -0.06029324233531952, -0.03888317942619324, -0.1661187708377838, 0.12604227662086487, 0.008757843635976315, 0.05211151763796806, -0.129885733127594, 0.11983935534954071, -0.17910820245742798, -0.04251319169998169, 0.13449931144714355, -0.019574016332626343, -0.17602883279323578, -0.10340723395347595, 0.25854095816612244, 0.28522157669067383, -0.201307013630867, 0.08512777090072632, 0.02908746898174286, -0.104347363114357, 0.07496228814125061, -0.09186733514070511, -0.0382520854473114, 0.11866041272878647, 0.1435098648071289, -0.041994184255599976, -0.0006075054407119751, -0.11805666983127594, 0.08328666538000107, 0.08788903802633286, 0.23828157782554626, 0.08741816878318787, 0.2706330716609955, -0.146730437874794, 0.02253711223602295, 0.05182710289955139, -0.09338320046663284, 0.13739193975925446, 0.015938183292746544, -0.19659630954265594, 0.10375815629959106, 0.22563037276268005, 0.20626384019851685, 0.09994565695524216, -0.1666056215763092, -0.05308181047439575, -0.03218764439225197, 0.12277257442474365, 0.1829455941915512, 0.0490640327334404, 0.1801494061946869, -0.034450381994247437, -0.19093874096870422, 0.2876370847225189, -0.1815575510263443, 0.04480433464050293, -0.06738604605197906, 0.014417711645364761, -0.05531112849712372, 0.09795084595680237, 0.010237989015877247, 0.08568628877401352, -0.008104607462882996, -0.11832261830568314, 0.058484625071287155, -0.1301726996898651, -0.1124907061457634, 0.18906155228614807, 0.23780977725982666, 0.2078518569469452, -0.030696198344230652, -0.18931756913661957, 0.11369192600250244], [0.10162994265556335, 0.2705053985118866, 0.04198223352432251, 0.09410446882247925, -0.08659028261899948, 0.14446358382701874, -0.07977326214313507, -0.09475129097700119, -0.1893165111541748, -0.1963154673576355, 0.1698860377073288, -0.21229486167430878, -0.03579282760620117, 0.05957558751106262, -0.06298553943634033, 0.032106731086969376, 0.15801797807216644, 0.06117602065205574, 0.20273184776306152, -0.20867802202701569, 0.2771838903427124, -0.015148716978728771, -0.1359875202178955, 0.15407142043113708, 0.09937501698732376, 0.19214613735675812, -0.05908361077308655, 0.06609600782394409, 0.14453700184822083, -0.08844412118196487, -0.13643023371696472, 0.003823932958766818, -0.07228194922208786, 0.19268082082271576, -0.12898799777030945, 0.2367437779903412, 0.0775274857878685, -0.12950702011585236, -0.02100066840648651, 0.07578891515731812, 0.04195046424865723, -0.11320501565933228, -0.023017950356006622, -0.25398731231689453, -0.09681782871484756, 0.277176171541214, -0.1641291379928589, 0.06168985366821289, -0.07757463306188583, -0.12996815145015717, -0.03029237873852253, 0.10116054117679596, -0.025919904932379723, -0.018854424357414246, -0.09158042818307877, -0.10869448632001877, -0.01201111264526844, -0.20303641259670258, -0.08518969267606735, -0.23157832026481628, 0.10584743320941925, -0.007569825742393732, -0.18242362141609192, 0.16430319845676422, -0.20686331391334534, -0.011284617707133293, 0.3451915681362152, -0.03152834624052048, 0.01263504195958376, -0.18593093752861023, 0.06034274399280548, 0.13695469498634338, 0.05410182476043701, 0.040990158915519714, -0.07975870370864868, -0.1965535283088684, -0.08843515068292618, -0.10505867004394531, -0.041825469583272934, 0.1523195505142212, 0.05593492090702057, -0.1408722698688507, -0.027695432305336, -0.09533844143152237, 0.13453178107738495, -0.20008927583694458, -0.19518457353115082, -0.24526400864124298, -0.14910095930099487, 0.36527198553085327, -0.19673791527748108, -0.012891218066215515, -0.12552906572818756, 0.1008799746632576, -0.04645500332117081, -0.04363912343978882, -0.08239109069108963, -0.010585546493530273, 0.1357414573431015, 0.27209287881851196, 0.27462252974510193, 0.18668361008167267, -0.07060202956199646, 0.33546462655067444, -0.21045111119747162, -0.13213025033473969, -0.17868417501449585, -0.020602857694029808, -0.20279215276241302, -0.14344850182533264, 0.19873829185962677, 0.3198176622390747, 0.023810047656297684, -0.154094859957695, 0.004268929362297058, -0.1642441749572754, -0.15969543159008026, 0.004023954272270203, 0.256906658411026, 0.2724938690662384, -0.21595025062561035, 0.19122359156608582, 0.14585649967193604, 0.00048528058687224984, -0.19913868606090546, -0.18536370992660522, -0.20387083292007446, 0.12243884801864624], [0.18852518498897552, -0.05534994602203369, 0.052988868206739426, -0.049135588109493256, -0.005745559930801392, 0.15081088244915009, -0.18146418035030365, 0.06514418870210648, 0.048478834331035614, -0.006302431225776672, -0.08054056763648987, -0.19907762110233307, -0.1877448856830597, 0.22999700903892517, -0.15725252032279968, -0.12124525010585785, -0.011289536952972412, -0.07748871296644211, 0.22160395979881287, -0.19861730933189392, 0.4103817343711853, -0.19428789615631104, -0.012078925967216492, 0.3335339426994324, 0.00538982916623354, 0.19324374198913574, 0.22638413310050964, -0.07122057676315308, 0.35106170177459717, -0.08791051805019379, -0.06026850640773773, 0.00012230091670062393, -0.24470174312591553, 0.3367936909198761, 0.07368005812168121, -0.0669788271188736, -0.06843087077140808, -0.13796773552894592, -0.04125553369522095, -0.1666603535413742, 0.21228478848934174, -0.142144113779068, -0.05712544918060303, -0.11137253046035767, -0.16814115643501282, 0.3123331069946289, -0.03874370828270912, 0.29791104793548584, -0.18694376945495605, -0.039489708840847015, -0.12555018067359924, 0.33522048592567444, 9.08948277356103e-05, -0.152086541056633, 0.3606647849082947, 0.3459700047969818, 0.034212853759527206, -0.1054505780339241, -0.07732179760932922, 0.02176905795931816, 0.2485467940568924, 0.22674381732940674, -0.042465925216674805, -0.10589177161455154, -0.08143780380487442, -0.17304940521717072, 0.2149495631456375, 0.3308815062046051, -0.021962642669677734, -0.15152181684970856, 0.11351069808006287, 0.39702674746513367, -0.05534232780337334, 0.026389319449663162, -0.05631916597485542, -0.08093272149562836, -0.09645296633243561, -0.13573738932609558, 0.029704470187425613, 0.24249859154224396, -0.18227148056030273, 0.16975489258766174, 0.02434278465807438, 0.029533501714468002, 0.4245557487010956, 0.3250117301940918, -0.1718328297138214, -0.23209929466247559, -0.12184899300336838, 0.4199129045009613, -0.14968547224998474, -0.07770811766386032, 0.15521758794784546, 0.33891186118125916, -0.15207163989543915, -0.15825994312763214, 0.09034092724323273, 0.2671947479248047, 0.29737284779548645, 0.09451078623533249, 0.3182334899902344, 0.030303627252578735, 0.37950462102890015, -0.19955791532993317, -0.09091977775096893, -0.1238304078578949, 0.17637380957603455, -0.09996619820594788, -0.17537488043308258, -0.17957590520381927, -0.07301414012908936, 0.31573188304901123, 0.3312990963459015, -0.14503762125968933, -0.09625446796417236, -0.05227278172969818, -0.01009112223982811, -0.009798827581107616, 0.18328256905078888, 0.1281668096780777, -0.042206067591905594, -0.19308891892433167, 0.3518977761268616, -0.17174343764781952, 0.17336821556091309, -0.10089927166700363, -0.2266673892736435, 0.2839241027832031], [-0.012802839279174805, 0.05125143751502037, -0.05058963596820831, -0.07328508794307709, -0.024289146065711975, 0.18015076220035553, -0.026662463322281837, 0.1076708659529686, -0.1447250247001648, -0.08460211008787155, 0.04564082995057106, -0.15185341238975525, -0.1639176607131958, -0.006768926978111267, 0.11266612261533737, 0.10313767939805984, 0.15387246012687683, 0.028103085234761238, 